src/cf/Documents/ПоступлениеУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ПоступлениеУслуг</Name>
			<BasedOn>
				<xr:Item>Document.ЗапросНаПеревозку</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОтложенныеВзаиморасчеты</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Запрос</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗапросНаПеревозку</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Перевозка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Перевозка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗагрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРазгрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУпр</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/AccumulationRegisters/ОтложенныеВзаиморасчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>ОтложенныеВзаиморасчеты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Перевозка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Перевозка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗапросНаПеревозку</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаОтЗаказчика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Documents/ПоступлениеУслуг/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	пзОбщегоНазначения.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	Документы.ПоступлениеУслуг.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	пзОбщегоНазначения.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	пзОбщегоНазначения.ОтразитьВзаиморасчетыСКонтрагентами(ДополнительныеСвойства, Движения, Отказ);
	пзОбщегоНазначения.ОтразитьОтложенныеВзаиморасчеты(ДополнительныеСвойства, Движения, Отказ);
	
	пзОбщегоНазначения.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	КонтрольОстатков(Отказ);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗапросНаПеревозку") Тогда
		
		РеквизитыЗаявки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, "Перевозка, Услуги");
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "Валюта, Контрагент, Организация, СуммаДокумента");	
		
		Услуги.Загрузить(РеквизитыЗаявки.Услуги.Выгрузить());
		
		Для Каждого Строка Из Услуги Цикл
			Строка.Перевозка = РеквизитыЗаявки.Перевозка;
			Строка.Запрос = ДанныеЗаполнения;
		КонецЦикла;
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура КонтрольОстатков(Отказ)
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОтложенныеВзаиморасчеты");
	ЭлементБлокировки.УстановитьЗначение("Организация", Организация);
	ЭлементБлокировки.УстановитьЗначение("Контрагент", Контрагент);
	ЭлементБлокировки.УстановитьЗначение("Валюта", Валюта);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = Услуги;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Перевозка", "Перевозка");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ДокументВзаиморасчетов", "Запрос");
	Блокировка.Заблокировать(); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Док.Валюта КАК Валюта,
	|	Док.Контрагент КАК Контрагент,
	|	Док.Организация КАК Организация,
	|	ДокУслуги.Запрос КАК ДокументВзаиморасчетов,
	|	ДокУслуги.Перевозка КАК Перевозка
	|ПОМЕСТИТЬ Док
	|ИЗ
	|	Документ.ПоступлениеУслуг.Услуги КАК ДокУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеУслуг КАК Док
	|		ПО ДокУслуги.Ссылка = Док.Ссылка
	|			И (Док.Ссылка = &Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтложенныеВзаиморасчетыОстатки.Организация КАК Организация,
	|	ОтложенныеВзаиморасчетыОстатки.Контрагент КАК Контрагент,
	|	ОтложенныеВзаиморасчетыОстатки.Перевозка КАК Перевозка,
	|	ОтложенныеВзаиморасчетыОстатки.ДокументВзаиморасчетов КАК ДокументВзаиморасчетов,
	|	ОтложенныеВзаиморасчетыОстатки.Валюта КАК Валюта,
	|	ОтложенныеВзаиморасчетыОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ОтложенныеВзаиморасчетыОстатки.СуммаУпрОстаток КАК СуммаУпрОстаток
	|ИЗ
	|	РегистрНакопления.ОтложенныеВзаиморасчеты.Остатки(
	|			&МоментВремени,
	|			(Контрагент, Организация, Перевозка, ДокументВзаиморасчетов, Валюта) В
	|				(ВЫБРАТЬ
	|					Док.Контрагент КАК Контрагент,
	|					Док.Организация КАК Организация,
	|					Док.Перевозка КАК Перевозка,
	|					Док.ДокументВзаиморасчетов КАК ДокументВзаиморасчетов,
	|					Док.Валюта КАК Валюта
	|				ИЗ
	|					Док КАК Док)) КАК ОтложенныеВзаиморасчетыОстатки
	|ГДЕ
	|	(ОтложенныеВзаиморасчетыОстатки.СуммаОстаток > 0
	|			ИЛИ ОтложенныеВзаиморасчетыОстатки.СуммаУпрОстаток > 0)";
	
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(Дата, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда    
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сумма поступления больше суммы запроса",,,, Отказ);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
